app/Services/BlogService.php

select "id", "first_name", "last_name", "email" from "users" where "users"."id" in (1, 2, 3, 4)
select count(*) as aggregate from "blogs"
---
    public function getAll()
    {

        $blogs = Blog::with([
            'user:id,first_name,last_name,email',
            'comments' => function ($query) {
                $query->orderBy('created_at', 'desc')
                    ->withCount('likes')
                    ->with([
                        'user:id,first_name,last_name,email',
                        'likes' => function ($query) {
                            $query->where('user_id', auth()->id());
                        },
                    ]);
            },
            'likes' => function ($query) {
                $query->where('user_id', auth()->id());
            },
        ])
            ->withCount('likes', 'comments') // eager loading to count likes and comments those are modal functions
            ->orderBy('created_at', 'desc')
            ->paginate(10);

select "id", "first_name", "last_name", "email" from "users" where "users"."id" in (3)
---
    public function show($blog)
    {
        $blog->loadCount(['likes', 'comments'])
            ->load([
                'user:id,first_name,last_name,email',
                'comments' => function ($query) {
                    $query->orderBy('created_at', 'desc')
                        ->withCount('likes')
                        ->with([
                            'user:id,first_name,last_name,email',
                            'likes' => function ($query) {
                                $query->where('user_id', auth()->id());
                            }
                        ]);
                },
            ]);