app/Services/BlogCommentService.php

    public function store($request, $blog)
    {
        $request['user_id'] = auth()->id();

        return $blog->comments()->create($request->all());
---
insert into "blog_comments" ("parent_id", "comment", "user_id", "blog_id", "updated_at", "created_at") values ('37', 'adfasdfadf', 4, 2, '2024-05-24 10:48:07', '2024-05-24 10:48:07')