app/Http/Controllers/Blog/BlogCommentController.php

    public function destroy(Blog $blog, BlogComment $comment)
    {
        if (auth()->id() != $comment->user_id) {
            abort(403, 'Unauthorized Access request');
        }
        $comment->delete();
---
delete from "blog_comments" where "id" = 34