app/Http/Controllers/HomeController.php

    public function index()
    {
        if (auth()->check() && !auth()->user()->hasVerifiedEmail()) {
            return redirect(route('verification.notice'));
        }
        $users = User::get();
---
select * from "users"